{    
    "portfolio-2022" : {
        "name": "This Portfolio",
        "description": "This website was made using a Preact +  TypeScript starter template. It utilizes Tailwind CSS and Daisy UI for styled components.",
        "liveUrl": "",
        "gitUrl": "https://github.com/Jiansorge/portfolio-2022",
        "imgUrl": "../assets/project-images/portfolio-2022.png",
        "imgAlt": "screenshot of 8-bit multicolored sunset from portfolio homepage",
        "subHeader1": "Preact + Typescript",
        "subDescription1": "I used Preact as a lightweight alternative to React ( 3.5kb vs. 135kb in size). Plus, it makes it easy to enable pre-rendering for SEO.",
        "subHeader2": "TailwindCSS + DaisyUI",
        "subDescription2": "I used this framework for ease of used. DaisyUI's and Kitwind.io's libraries made it easy to generate great looking and responsive components.",
        "subHeader3": "JSON Data Model",
        "subDescription3": "All projects data is stored in a single JSON of key/values.",
        "subHeader4": "Lighthouse Scores",
        "subDescription4": "Google Lighthouse measured the following mean scores across the app:\n 80 Performance,\n 100 Accessibility,\n 100 Best Practices,\n 100 SEO"
    },
    "bionic-advertising-systems" : {
        "name": "Bionic Advertising Systems",
        "description": "Bionic is #1 rated media planning software + media buying software that delivers perfect media plans, beautiful flowcharts, online RFPs and IOs, flawless trafficking, delivery pacing, KPI performance monitoring, automated reconciliations, client dashboards, and more!",
        "liveUrl": "https://www.bionic-ads.com/agencies/demo/",
        "gitUrl": "",
        "imgUrl": "../assets/project-images/bionic-advertising-systems.png",
        "imgAlt": "screenshot of product info from Bionic Advertising Systems",
        "subHeader1": "All-in-One",
        "subDescription1": "Bionic is the only fully integrated media planning and media buying software for digital, TV, radio, print, OOH, and all other media channels.",
        "subHeader2": "#1 Rated",
        "subDescription2": "Voted “Best Agency Tool” by iMedia. Rated 4.8/5 stars by users.",
        "subHeader3": "Easy",
        "subDescription3": "Modern, intuitive media planning tool. If you can use Excel, you can use Bionic.",
        "subHeader4": "Fast",
        "subDescription4": "Hassle-free. 100% cloud-based. You’ll be up and running in minutes!"
    },
    "advertise-with-us" : {
        "name": "Advertise With Us",
        "description": "Search the world's largest directory of advertising programs.",
        "liveUrl": "https://www.advertise-with-us.com/",
        "gitUrl": "",
        "imgUrl": "../assets/project-images/awu.png",
        "imgAlt": "screenshot of product info from Advertise With Us",
        "subHeader1": "Server Side Rendered Vanilla HTML",
        "subDescription1": "HTML+JS is delivered via SSR .jsp servlet technology to securely withhold API key.",
        "subHeader2": "Reponsive Design",
        "subDescription2": "Tailwind CSS was useful in generating predefined media queiries for collapsible components.",
        "subHeader3": "Enhanced SEO",
        "subDescription3": "JSON-LD, sitemaps and other features provided for enhanced SEO.",
        "subHeader4": "Lighthouse Scores Over 97",
        "subDescription4": "Google Lighthouse measured the following scores across the app:\n 98 Performance,\n 97 Accessibility,\n 100 Best Practices,\n 100 SEO"
    },
    "sonar-strike" : {
        "name": "Sonar Strike",
        "description": "Prototype Underwater Shooter. High-speed  space shooter game made in entirely in React and JavaScript. Final project for JSCRIPT-300, React front-end development course.",
        "liveUrl": "https://sonar-strike.jiansorge.now.sh/",
        "gitUrl": "https://github.com/Jiansorge/JSCRIPT-300-Final-Project",
        "imgUrl": "../assets/project-images/sonic-striker-home.png",
        "imgAlt": "Starting page of gameplay with sonar blasting dolping on a tropical island background",
        "subHeader1": "Cloned Game Mechanics",
        "subDescription1": "This was cloned from another game. I updated the game mechanics, styling, and menu navigation to create an entirely new look and feel.",
        "subHeader2": "Entirely React and JavaScript",
        "subDescription2": "All game logic is written in JS.",
        "subHeader3": "Prototype Project",
        "subDescription3": "Gameplay only features one static level and type of enemy. It is not playable on certain devices.",
        "subHeader4": "What's your high score?",
        "subDescription4": "If you can keep clicking fast enough, it's pretty hard to lose!"
    },
    "hugos-it-consulting" : {
        "name": "Hugo's IT Consulting",
        "description": "Professional technology management services for server infrastructure configuration and operation, project management, Microsoft Windows Servers, AV, quarterly reporting, procurement, technical user documentation, and implementing organizational IT management processes.",
        "liveUrl": "https://hugos-it-consulting.netlify.app/",
        "gitUrl": "https://github.com/Jiansorge/hugos-it-consulting",
        "imgUrl": "../assets/project-images/hugos-it-consulting.png",
        "imgAlt": "",
        "subHeader1": "Built using Astrowind",
        "subDescription1": "AstroWind is a free and open-source template to make your website using Astro 2.0 + Tailwind CSS. Designed taking into account web best practices.",
        "subHeader2": "Perfect Google Lighthouse Socres",
        "subDescription2": "Thanks to Astrowind, this page has perfect scores of 100 for Performance, Accessibility, Best Practices, and SEO.",
        "subHeader3": "Image Optimization",
        "subDescription3": "Astro provides <Image /> and <Picture> components as well as a basic image transformer, with full support for static sites and server-side rendering.",
        "subHeader4": "Deployed on Netlify",
        "subDescription4": "Netlify's CLI makes it easy to deploy a built webapp."
    }
}